system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                   Euler;
}

gradSchemes
{
    default                   Gauss linear;
    // default                   leastSquares;
}

divSchemes
{
    default                   none;

    div(rhoPhi,U)             Gauss linearUpwind grad(U);
    // div(rhoPhi,U)             Gauss limitedLinearV 1;
    // div(rhoPhi,U)             Gauss upwind;

    // div(U)          Gauss linear;

    div(phi,alpha)            Gauss vanLeer;
    div(phirb,alpha)          Gauss linear;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default                   Gauss linear corrected;
    // default                   Gauss linear orthogonal;
}

interpolationSchemes
{
    default                   linear;
}

snGradSchemes
{
    default                   corrected;
    // default                   orthogonal;
}

oversetInterpolation
{
    method                    cellVolumeWeight;
    // The inverseDistance method uses a 'voxel' like search structure
    // method                    inverseDistance;
    // method                    leastSquares;
}

fluxRequired
{
    default                   no;
    p_rgh;
    pcorr;
    p;
    alpha.heavyFluid;
}

oversetInterpolationSuppressed
{
    // grad(p_rgh);
    // surfaceIntegrate(phiHbyA);
}

// ************************************************************************* //
