system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellDisplacement
    {
        solver                PCG;
        preconditioner        DIC;

        tolerance             1e-06;
        relTol                0;
        maxIter               100;
    }

    "alpha.heavyFluid.*"
    {
        nAlphaCorr            1;
        nAlphaSubCycles       3;
        // level of interface compression. 0 = none, 1 = conservative, >1 = enhanced
        cAlpha                0;

        MULESCorr             yes; // Switches on semi-implicit MULES
        nLimiterIter          8;   // Number of MULES iterations over the limiter
        alphaApplyPrevCorr    no;

        solver                smoothSolver;
        smoother              symGaussSeidel;
        tolerance             1e-8;
        relTol                0;
    }

    // p_rgh
    // {
    //     solver                PCG;
    //     preconditioner        DIC;
    //     tolerance             1e-6;
    //     relTol                0.1;
    // }
    p_rgh
    {
        solver                PBiCGStab;
        preconditioner        DILU;
        tolerance             1e-6; //1e-9;
        relTol                0.01;
        maxIter               500;
    }

    // p_rghFinal
    // {
    //     solver                GAMG;
    //     smoother              DIC;
    //     tolerance             1e-9;
    //     relTol                0;
    // }
    p_rghFinal
    {
        $p_rgh;
        relTol                0;
    }

    "pcorr.*"
    {
        solver                PCG;
        preconditioner        DIC;
        tolerance             1e-6; //1e-9
        relTol                0;
    }

    // U
    // {
    //     solver                smoothSolver;
    //     smoother              symGaussSeidel;
    //     tolerance             1e-08;
    //     relTol                0;
    // }
    U
    {
        solver                PBiCG;
        preconditioner        DILU;
        tolerance             1e-6;
        relTol                0.1;
    }

    UFinal
    {
        solver                PBiCG;
        preconditioner        DILU;
        tolerance             1e-6;
        relTol                0;
    }
}

PIMPLE
{
    // Controls solving of the momentum predictor
    // Typically set to off for some flows including multiphase
    momentumPredictor         no;
    // Continuity due to cells deformation
    correctPhi                no;
    // nOuterCorrections = 1 equals to PISO
    nOuterCorrectors          1;
    nCorrectors               2;
    nNonOrthogonalCorrectors  2;

    ddtCorr                   true;
}

// ************************************************************************* //
