system/geometry
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

domainWidth   0.01;

tankBottom   -0.8;
tankTop       1.2;
tankLeft     -1.0;
tankRight     1.0;

cylRad        0.1;
outerRad      0.3;

// ************************************************************************* //
