system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue zoneID 123
    volScalarFieldValue alpha.heavyFluid 0
);

regions
(
    cellToCell
    {
        set staticCells;

        fieldValues
        (
            volScalarFieldValue zoneID 0
        );
    }

    cellToCell
    {
        set dynamicCells;

        fieldValues
        (
            volScalarFieldValue zoneID 1
        );
    }

    boxToCell
    {
        box ( -100 -100 -100 ) ( 100 100 0.4 );
        fieldValues
        (
            volScalarFieldValue alpha.heavyFluid 1
        );
    }
);

// ************************************************************************* //
